{"/concepts/infra-overview":{"title":"Infrastructure Overview","data":{"":"LearnHouse is separated into two parts/codebases :\nFrontend : Web interface for the user to interact with the application, some parts are server rendered and some are client rendered, we use React Server Components enabled by Next.js 14\nBackend : Backend code in Python using FastAPI that handles : Storage, Authentication, Uploads, AI etc.\nHere is a diagram that explains the infrastructure in a simple way to get started :"}},"/dev/backend-migrations":{"title":"Backend Migrations","data":{"":"This is a guide to use migrations for LearnHouse, it will walk you through the process of using migrations in the backend.","prerequisites#Prerequisites":"Docker\nPython 3.12.x\nPoetry\nAlembic\nmacOS, Linux or Windows\nFor details on setting up the backend dev environment, see Setting Up Your Dev Environment","general-concepts#General Concepts":"Generally, we use Alembic for SQL migrations.\nMake sure to check out their tutorial if you have never used it before.","adding-migrations#Adding Migrations":"","navigate-to-your-backend-directory-at-appsapi#Navigate to your backend directory at apps/api":"Then use the following command to indicate that the database is already using the newest state.\nMake sure that the production app (in the container stack) was running at least once.\nThis way, you can guarantee that the DB is up-to-date.\npoetry run alembic stamp head","perform-changes-in-the-db#Perform Changes In The DB":"Perform any change on the schema of the database, you could add a table for the \"Example\" feature, for instance.\nTo generate a revision with the changes you did on your DB.\npoetry run alembic revision --autogenerate -m \"Example\"","check-migrations-history#Check Migrations History":"Check your migrations history\npoetry run alembic history","perform-all-the-migrations#Perform all the Migrations":"Do all the migrations\npoetry run alembic upgrade head\nIn order to check the migrations, visit a local directory that maps to this path.\nFor downgrading the latest migration, you can use alembic downgrade -2.\nMake sure to consult the Alembic docs for further information."}},"/features/ai/students":{"title":"For students","data":{"":"LearnHouse AI provides different features for students to help them in their learning process.\nChat with activity :  Students can chat with the bot and ask questions about the course. The bot will answer the questions and provide the students with the necessary information.","context-aware#Context aware":"LearnHouse AI is context aware. It can understand the context of the course and the activity and replies accordingly."}},"/features/ai/teachers":{"title":"For teachers","data":{"":"LearnHouse AI provides different features to improve teachers workflow while teaching online & writing content.\nWriter : Write content with AI assistance.\nContinue writing : Based on a paragraph or a sentence, AI can continue writing the content.\nMake longer : AI can make the content longer bsed on the text selected.\nTranslate : Translate the content to different languages.","context-aware#Context aware":"LearnHouse AI is context aware. It can understand the context of the content and provide suggestions based on the context of your course and previous paragraphs."}},"/features/content/activities/documents":{"title":"Documents","data":{"":"Using Document activities, you can upload a document (PDF only for now) and make it part of your course.This is an important feature that can enhance the learning experience of your students. With this tool, you can provide them with additional resources and reading materials that can help them understand the concepts better."}},"/features/content/activities/dynamic-pages":{"title":"Dynamic pages","data":{"":"Dynamic pages are pages that can contains different types of content at the same time, we call them blocks.\nThere is different Blocks for you to choose :\nCallouts : Banners that contains informations, warnings, etc.\nImages : Uploadable Images.\nVideo : Uploadable Video Content.\nYouTube Video : Videos from YouTube.\nMath Equations : Equations in LaTeX format.\nPDF Document : PDF files that can be viewed directly from the page.\nInteractive Quiz : Quizzes with questions and answers.\nWe’ll add more soon.\nWe designed the Dynamic Editor to be extremely easy to use and easy to learn, we’re also making it collaborative and up to 5 persons can collaborate on the same page."}},"/features/content/activities/videos":{"title":"Video Activities","data":{"":"Video activities serve as valuable resources to enhance the learning experience by providing visual and audio content.You can either upload your videos or use videos from YouTube. We’ll be adding more video sources later."}},"/features/content/collections":{"title":"Collections","data":{"":"Collections is a feature that enables teachers to group and organize courses based on similar themes, topics, or learning objectives.By using collections, learners can easily navigate through a variety of courses that are relevant to their interests and goals.\nFurthermore, collections can be used to create personalized learning paths that cater to the unique needs and preferences of individuals (will be supported in a future update)With collections, users can also save time and effort by accessing all relevant courses in one place, instead of having to search for them individually. In addition, collections can serve as a tool for instructors and administrators to provide a more structured and coherent learning experience to their learners, by grouping courses in a logical and meaningful way."}},"/features/content/courses":{"title":"Courses","data":{"":"Courses are a fundamental feature of LearnHouse, they should contain chapters and chapters contains activities.\nThere is a wide variety of Activities types to choose from, and we are constantly adding more.\nCourses can be part of a Collection, saving users time and effort by accessing all relevant courses in one place, instead of having to search for them individually. In addition, collections can serve as a tool for instructors and administrators to provide a more structured and coherent learning experience to their learners, by grouping courses in a logical and meaningful way.When Starting a new Course, progression data is stored in your Trail including Quizzes data and Assignments. (Coming soon)"}},"/features/editor/blocks":{"title":"Blocks","data":{"":"Blocks are content elements that can be added to a page. They can be any type of content, videos, text, images, quizzes etc.Blocks can be added to a page in any order and can be rearranged as needed.","block-types#Block types":"Text : Add text to your page\nImage : Add images to your page\nCallouts (Info, Warning) : Callouts are used to highlight important information\nVideo (Youtube, Hosted) : Videos can be added to your page, either from Youtube or hosted on Learnhouse\nQuiz : Inline quizzes can be added to your page\nCode : Code blocks that supports syntax highlighting for multiple languages\nFile : Show PDF files on your page\nMath : Math equations can be added to your page\nTables (Soon)\nAudio (Soon)\nEmbed (Soon)"}},"/features/editor/collaboration":{"title":"Live Collaboration","data":{"":"Collaborate with your team in real-time. See who is editing a document, and what they are changing."}},"/features/trails":{"title":"Trails","data":{"":"Trails are a key feature on Learnhouse that enables teachers & students to track their progress through Courses.By using Trails, teachers can effectively use quiz results and text-based course progression to tailor feedback in-person & remotely. It also lets students keep a track of their own progression through the course, and encourage increased self-determination & confidence."}},"/features/user-management/users-and-access":{"title":"Users management","data":{"":"You can manage users from the admin dashboard. You can add, remove, and edit users. You can also assign roles to users.\nUsers : Add new users, remove users, and edit their roles and permissions.\nInvite users : Invite new users to join your organization by sending them an email and assigning them to a UserGroup.\nSignup Acess : Enable or disable the signup access for new users, if disabled only userd with an invite code can join the organization."}},"/":{"title":"Getting started with Sokrates","data":{"what-is-sokrates#What is Sokrates?":"Sokrates is an open source LMS (learning management system) platform based on Learnhouse that makes it easy for anyone to provide world class educational content. One of the main features is that it offers a variety of content types: Dynamic Pages, Videos, Documents & more..","features#Features":"📄✨ Dynamic Notion-like WYSIWYG pages\n👨‍🎓 Easy & simple to use\n👥 Multi-Organizational\n📹 Supports Uploadable Videos and external videos like YouTube\n📄 Supports documents like PDF\n🍱 Course Collections\n🙋 Interactive Quizzes\n👟 Overall course progress\n⚡ (Incoming) Live Collaboration\nMore to come"}},"/self-hosting/ai":{"title":"AI Self Hosting","data":{"":"AI can be used in your self hosted instance of LearnHouse, it is powered by OpenAI and you will need to create an account and get an API key to use it.To enable AI in your self hosted instance, you will need to follow the steps below.","enabling-ai#Enabling AI":"Either use environment variables or the config file to enable AI.","environment-variables#Environment Variables":"LEARNHOUSE_OPENAI_API_KEY - Your OpenAI API key\nLEARNHOUSE_IS_AI_ENABLED - Set to true to enable AI, false to disable it","config-file#Config file":"site_name: LearnHouse\nsite_description: LearnHouse is an open-source platform tailored for learning experiences.\ncontact_email: hi@learnhouse.app\nhosting_config:\n  domain: learnhouse.app\n  ssl: true\n  allowed_origins:\n    - http://localhost:3000\n    - http://localhost:3001\n  cookies_config:\n    domain: \".localhost\"\n  allowed_regexp: '\\b((?:https?://)[^\\s/$.?#].[^\\s]*)\\b'\ndatabase_config:\n  sql_connection_string: postgresql://learnhouse:learnhouse@postgresql:27017/\nai_config:\n    openai_api_key: \"your-openai-api-key\"\n    is_ai_enabled: true","organizations#Organizations":"AI is enabled on a per-organization basis, you can enable or disable AI for each organization, choose what model and features to use and set the usage limit.\nThe Organization config model is subject to change in future versions of LearnHouse","organization-config-table#Organization Config table":"Every Organization comes with a dedicated row in the organizationconfig table, you can find the config  json column and set the AI configuration for that organization.\n{\n  \"AIConfig\": {\n    \"ai_model\": \"gpt-3.5-turbo\",\n    \"embeddings\": \"text-embedding-ada-002\",\n    \"enabled\": true,\n    \"features\": {\n      \"activity_ask\": true,\n      \"course_ask\": false,\n      \"editor\": true,\n      \"global_ai_ask\": false\n    },\n    \"limits\": {\n      \"limits_enabled\": true,\n      \"max_asks\": 200\n    }\n  },\n  \"GeneralConfig\": {\n    \"active\": true,\n    \"color\": \"#000000\",\n    \"limits\": {\n      \"limits_enabled\": false,\n      \"max_staff\": 0,\n      \"max_storage\": 0,\n      \"max_users\": 0\n    },\n    \"users\": {\n      \"signup_mechanism\": \"inviteOnly\"\n    }\n  }\n}"}},"/self-hosting/configuration":{"title":"Configuration","data":{"":"For self hosted LearnHouse users, a custom configuration file can be used to suit your needs.","backend-config-file#Backend config file":"Here is an example of the config.yaml file :\nsite_name: LearnHouse\nsite_description: LearnHouse is an open-source platform tailored for learning experiences.\ncontact_email: hi@learnhouse.app\ngeneral:\n  development_mode: false\n  install_mode: false\nsecurity:\n  auth_jwt_secret_key: secret\nhosting_config:\n  domain: learnhouse.app\n  ssl: true\n  port: 1338\n  allowed_origins:\n    - http://localhost:3000\n    - http://localhost:3001\n  cookies_config:\n    domain: \".localhost\"\n  allowed_regexp: '\\b((?:https?://)[^\\s/$.?#].[^\\s]*)\\b'\n  content_delivery:\n    type: \"filesystem\" # \"filesystem\" or \"s3api\"\n    s3api:\n      bucket_name: \"\"\n      endpoint_url: \"\"\nmailing_config:\n  resend_api_key: \"\"\n  system_email_adress: \"\"\ndatabase_config:\n  sql_connection_string: postgresql://learnhouse:learnhouse@localhost:5432/learnhouse\nredis_config:\n  redis_connection_string: redis://localhost:6379/learnhouse\nYou can also use a .env file to configure your backend.\nIf an environment variable is set, it will override the value in the config.yaml file\nLEARNHOUSE_SITE_NAME=LearnHouse\nLEARNHOUSE_SITE_DESCRIPTION=LearnHouse is an open-source platform tailored for learning experiences.\nLEARNHOUSE_CONTACT_EMAIL=hi@learnhouse.app \nLEARNHOUSE_DOMAIN=learnhouse.app\nLEARNHOUSE_SSL=true\nLEARNHOUSE_USE_DEFAULT_ORG=true\nLEARNHOUSE_ALLOWED_ORIGINS=http://localhost:3000,http://localhost:3001\nLEARNHOUSE_COOKIE_DOMAIN=.localhost\nLEARNHOUSE_ALLOWED_REGEXP=\\b((?:https?://)[^\\s/$.?#].[^\\s]*)\\b\nLEARNHOUSE_SELF_HOSTED=false\nLEARNHOUSE_SQL_CONNECTION_STRING=postgresql://learnhouse:learnhouse@postgresql:5432/learnhouse","general-metadata#General Metadata":"","site-name#Site name":"Your site name","site-description#Site description":"A short description","contact-email#Contact email":"Your designated contact email address.","hosting-config#Hosting Config":"","domain#Domain":"You site's technical domain","ssl#SSL":"Is SSL used?","allowed-origins#Allowed Origins":"A list of origins that should be permitted to make cross-origin requests to your website.","allowed-origins-regex#Allowed Origins Regex":"A regex string to match against origins that should be permitted to make cross-origin requests to your website.","cookies-domain#Cookies Domain":"Your frontend domain, the domain will be assigned to cookies that the backend emits, authentication and parts of your site would not work if not configured properly.The value used in the yaml should be in the \"string\" format.","sub-domains#Sub Domains":"If you want to use the backend for different subdomains locations, for example :\ndomain.app\nacme1.domain.app\nacme2.domain.app\nYou can add a . before your domain, here it would be .domain.app","database-config#Database Config":"","postgresql-connection-string#PostgreSQL Connection string":"As of December 2023, we've transitioned our database structure to PostgreSQL.\nYour PostgreSQL Database connection string","redis-config#Redis Config":"","redis-connection-string#Redis connection string":"Your Redis Database connection string","mailing-config#Mailing Config":"","resend-api-key#Resend API Key":"Your Resend API Key","system-email-address#System Email Address":"Your System Email Address","frontend-config-file#Frontend config file":"You can also configure your frontend by creating a .env file in the apps/web folder.","authentication-oauth-configuration#Authentication (Oauth) configuration":"Following the integration of OAuth using NextAuth to manage sign-ups/ins. For this to work, you now need to add two lines to your .env config file.\nTo safely encrypt tokens and email hashes, you need a NextAuth secret.To create one, either run npx auth secret, or on UNIX based systems (MacOS/Linux) you can use openssl rand -base64 33.Copy this string into your .env file as NEXTAUTH_SECRET.\nHere is an example of the .env file :\n# Learnhouse configuration\nNEXT_PUBLIC_LEARNHOUSE_MULTI_ORG=false\nNEXT_PUBLIC_LEARNHOUSE_DEFAULT_ORG=defaultorg\n# NextAuth Configuration\nNEXTAUTH_SECRET={generated_secret}\nNEXTAUTH_URL=http://localhost:3000/\nTo learn more about Custom Authentication, visit the NextAuth docs here.","multi-organizations#Multi Organizations":"Please check the Multi Organization section for more information."}},"/self-hosting/content-storage/filesystem":{"title":"Filesystem Storage","data":{"":"Images, Documents and Videos can be stored in your filesystem, it uses the /content folder on the project directory to store files.","containers#Containers":"If you are using Kubernetes or Containerised environments you should make sure to use Volumes (Docker) or Persistent Volumes (Kubernetes)  for your /content folder\nDocker Volumes\nKubernetes"}},"/self-hosting/content-storage/s3":{"title":"S3","data":{"":"We're still working on S3-compatible storage support."}},"/self-hosting/organization-hosting-modes":{"title":"Organization Hosting Modes","data":{"":"Multi Organization setup is still work in progress \nLearnHouse supports Multi Organizations (Multi-Tenacy), which means you can have multiple organizations using the same platform and therefore the same instance of LearnHouse.Your Organizations will share the same database and have their content, files, users on the database marked by organization_id and every request will be scoped to that organization.","single-organization-setup#Single Organization setup":"Single Organization setup is the default when installing Learnhouse for the first time.\nWhen using a Single Organization Setup you should refer your Organization's slug in the frontend config file","frontend-config#Frontend Config":"NEXT_PUBLIC_LEARNHOUSE_MULTI_ORG=false\nNEXT_PUBLIC_LEARNHOUSE_DEFAULT_ORG=defaultorg","multi-organization-setup#Multi Organization setup":"At the moment, only Single Organizations are supported by Self-Hosting.","frontend-config-1#Frontend Config":"NEXT_PUBLIC_LEARNHOUSE_MULTI_ORG=true"}},"/self-hosting/overview":{"title":"Self Hosting Overview","data":{"":"LearnHouse is open source software and can be installed and maintained on just about any Cloud provider. We also support different hosting schemas like using AWS S3 or CloudFlare R2 for content storage.","learnhouse-cloud-vs-self-hosting#LearnHouse Cloud vs Self Hosting":"A common question we get from developers is whether they should use our official platform, or host the codebase on their own server independently. Deciding which option is best for you comes with some nuance, so below is a breakdown of the differences to help you decide what will fit your needs best.\n\tLearnHouse Cloud\tSelf Hosting\t🌍 Worldwide CDN\tIncluded\tManual + Additional cost\t🔄 Weekly updates\t✅\tManual\t🚧 Maintenance & Updates\t✅\tManual\t🛡️ Security\t✅\tManual\t⚠️ Threat & uptime management\t✅\t❌\t🔒 SSL Certificate\t✅\tManual\t📦 Continuous Backups\t✅\tManual + Additional cost\t⚡ Scalability\t✅\tDepends on the cloud provider\t👨‍💻 Direct SSH & DB access\t❌\t✅\t🚑 Product Support\tEmail\tCommunity\t💟 Where your money goes\tSupporting the team + New Features in LearnHouse\t3rd party companies","prerequisites#Prerequisites":"Docker\nA server with at least 2GB of RAM","guides#Guides":"Self hosting Guide\nConfigure LearnHouse"}},"/dev/setup-dev-environment":{"title":"Setting up a Dev environment","data":{"":"This is a guide to set up a dev environment for LearnHouse, it will guide you through the installation of the backend and the frontend.","prerequisites#Prerequisites":"Docker\nNode.js 21.x\npnpm\nPython 3.12.x\nPoetry\nmacOS, Linux or Windows","backend-configuration#Backend configuration":"","get-the-repository#Get the repository":"git clone https://github.com/sokrates-ai/platform\ncd platform","prepare-local-development-environment#Prepare Local Development Environment":"make setup\nThis will install all the dependencies needed and spin up the following containers for development:\nA Postgres database\nA Redis server\nA Chromadb server\nMake sure your container runtime has at least 4GB of RAM allocated, as default\nsettings may vary by tool","run-the-backend-and-frontend-in-development-mode#Run the Backend and Frontend in Development Mode":"","run-the-backend-in-dev-mode#Run the Backend in Dev mode":"make api-dev\nmake web-dev","check-the-api#Check the API":"Go to http://localhost:1338/docs/","congratulations-youre-done-#Congratulations, you're done! 🎉":"Visit the app at http://localhost:3000/\nIf your development database gets corrupted, try running the following command:\nmake reset","next-steps#Next Steps":"Thanks for contributing to Sokrates  💟\nSokrates GitHub"}},"/self-hosting/hosting-guide":{"title":"Self hosting guide","data":{"":"We use Docker & Docker Compose to run Sokrates, this makes it easy to run the application on any machine that has Docker installed.Tested on:\nmacOS Sonoma\nUbuntu 23.04 Lunar lobster\n(Need testers on Windows)\nInterested in helping test on Windows? Join our Discord community.","prerequisites#Prerequisites":"Docker\nAt least 4 GB of RAM allocated to the container runtime","step-by-step#Step by step":"","install-docker#Install Docker":"To install Docker, follow the instructions for your operating system on the Docker website.","download-the-sokrates-repository#Download the Sokrates repository":"git clone https://github.com/sokrates-ai/platform","go-to-the-directory#Go to the directory":"cd sokrates","configure-nextauth#Configure NextAuth":"Add these lines to your .env file. A template is available under /extra/example-learnhouse-conf.env.\nTo safely encrypt tokens and email hashes, you need a NextAuth secret.To create one, either run npx auth secret, or on UNIX based systems (MacOS/Linux) you can use openssl rand -base64 33.Copy this string into your .env file as NEXTAUTH_SECRET=\n# NextAuth Configuration\nNEXTAUTH_SECRET={generated_secret}\nNEXTAUTH_URL=http://localhost:3000/","build-and-run-sokrates#Build and run Sokrates":"docker-compose up -d","access-sokrates#Access Sokrates":"When running the application for the first time, an admin account and organization is created for you, look for the admin credentials in the logs.","login-to-your-account#Login to your account":"Open your browser and go to http://localhost/login to access the application.","change-your-password#Change your password":"After logging in, don't forget to change your password\nIt is important to change the default password to a another one, reducing the risk of unauthorized access if your server is compromised.","youre-all-set#You're all set!":"Thanks for using Sokrates 🎉","further-configuration#Further configuration":"You should be ready to go when following the steps above but if you'd live to enable features like AI, Emails, Multi-org, or customize the application, check the configuration guide.","environment-variables-usage-with-the-sokrates-docker-image#Environment variables usage with the Sokrates Docker image":"You can mix frontend and backend env vars defined in the COnfiguration page, in a single file like the one included on the repository (extra/example-learnhouse-conf.env)\n# Frontend\nNEXT_PUBLIC_LEARNHOUSE_MULTI_ORG=false\nNEXT_PUBLIC_LEARNHOUSE_DEFAULT_ORG=default\n# Backend\nLEARNHOUSE_COOKIE_DOMAIN=.localhost\nLEARNHOUSE_SQL_CONNECTION_STRING=postgresql://learnhouse:learnhouse@db:5432/learnhouse\nLEARNHOUSE_REDIS_CONNECTION_STRING=redis://redis:6379/learnhouse\napp:\n    build: .\n    ports:\n      - \"80:80\"\n    volumes:\n      - .:/usr/learnhouse\n    env_file:\n      - ./extra/example-learnhouse-conf.env\n    depends_on:\n      db:\n        condition: service_healthy\n      redis:\n        condition: service_healthy","found-bugs-#Found bugs ?":"If you find any bugs or have any suggestions, please open an issue on our GitHub repository, we would love to hear from you.Please include as much information as possible, like the steps to reproduce the bug, the expected behavior and the actual behavior."}}}